{
  "Button": {
    "learn-more": "Learn More",
    "read-more": "Read More",
    "load-more": "Show More",
    "load-less": "Show Less",
    "search": "Search"
  },

  "NavigationBar": {
    "home": "Home",
    "about-us": "About Us",
    "our-collections": "Collections",
    "tools": "Tools",
    "highlights": "Highlights",
    "online-resources": "Resources",
    "outreach": "Outreach",
    "vietnam-for-educators": "Việt Nam for Educators",
    "understanding-vietnam": "Understanding Việt Nam"
  },

  "Home": {
    "welcome-subtitle": "A digital hub to study pre-modern and modern Vietnam",
    "about-digitizing-vietnam": "About Digitizing Vietnam",
    "about-digitizing-vietnam-content": "Digitizing Vietnam marks a digital leap forward in Vietnam Studies with the Columbia-Fulbright collaboration. The joint venture started with the memorandum of understanding between two universities in 2022. Weatherhead East Asian Institute of Columbia and Vietnam Studies Center of Fulbright will be spearheading research in the field of Vietnam studies, and Digitizing Vietnam will be one among many collaborative endeavors to come in the future.",
    "our-collections": "Our Collections",
    "our-collections-content": "Do you want to try reading Hán-Nôm scripts, or to see how chữ quốc ngữ was used in the early 20th century? Our eclectic collections range from pre-modern Hán-Nôm texts to the first Vietnamese women's magazine. While by no means comprehensive, they provide rarely seen snapshots of Vietnamese history.",
    "our-blog": "Our Blog",
    "our-blog-content": "The blog is a special part in this digital hub for studies on both premodern and modern Vietnam. Here, you will find scholarly research as well as non-specialist insights related to Vietnam's historical and cultural evolution. We also invite you to contribute to the discussion on our collections, and share any insights you might have."
  },

  "AboutUs": {
    "title": "About Us"
  },

  "Collection": {
    "title": "Our Collections",
    "subtitle": "Explore our digital archive dedicated to the preservation and academic exploration of Vietnam's historical and intellectual heritage.",
    "our-volumes": "Items",
    "featured-articles": "Featured Articles",
    "no-volume-found": "No volumes found."
  },

  "Highlight": {
    "title": "Vietnam Digitized: A Blog",
    "subtitle": "News, insights and initiatives on the digital front of Vietnamese heritage.",
    "news": "News",
    "highlights": "Highlights",
    "initiatives": "Initiatives"
  },

  "OnlineResource": {
    "title": "Online Resources",
    "subtitle": "Are you looking for a launchpad for your research on Vietnam? Check out some resources below and find the best fit.",
    "no-resource-message": "There are no resources available for this category."
  },

  "SearchResult": {
    "title": "Search Results",
    "showing": "Showing",
    "search-result-for": "search results for",
    "no-search-result": "No search results found."
  }
}
