{
  "Button": {
    "learn-more": "Tìm hiểu thêm",
    "read-more": "Đọc thêm",
    "load-more": "Hiển thị thêm",
    "load-less": "Hiển thị bớt",
    "search": "Tìm kiếm",
    "copy-url": "Sao chép URL",
    "next": "Tiếp",
    "previous": "Trước",
    "go-to-page": "Đi đến trang",
    "close": "Đóng",
    "cancel": "Hủy",
    "look-up": "Tra cứu",
    "looking-up": "Đang tra cứu..."
  },

  "Toast": {
    "copied": "Đã sao chép!",
    "failed-to-copy": "Sao chép không thành công",
    "error-occurred": "Có lỗi xảy ra. Vui lòng thử lại sau."
  },

  "Tips": {
    "lookupable-text": "Nhấp vào kí tự Hán Nôm để tra cứu trong từ điển."
  },

  "ErrorPage": {
    "not-found": "Không tìm thấy trang",
    "not-found-message": "Trang bạn đang tìm kiếm không tồn tại.",
    "back-to-home": "Quay lại trang chủ"
  },

  "NavigationBar": {
    "home": "Trang chủ",
    "about-us": "Về chúng tôi",
    "our-collections": "Bộ sưu tập",
    "tools": "Công cụ số",
    "highlights": "Bài viết",
    "online-resources": "Tài nguyên",
    "outreach": "Thư viện",
    "vietnam-for-educators": "Việt Nam cho giáo viên",
    "understanding-vietnam": "Hiểu về Việt Nam"
  },

  "Home": {
    "welcome-subtitle": "Trung tâm số hóa nghiên cứu về Việt Nam cận đại và hiện đại",
    "about-digitizing-vietnam": "Về Dự án Số hóa Việt Nam",
    "about-digitizing-vietnam-content": "Dự án Số hóa Việt Nam là bước nhảy vọt số hóa trong nghiên cứu Việt Nam do Columbia và Fulbright hợp tác. Dự án bắt đầu từ hiệp định ghi nhớ giữa hai trường đại học vào năm 2022. Viện Đông Á học của Đại học Columbia và Trung tâm Nghiên cứu Việt Nam của Fulbright sẽ dẫn đầu trong nghiên cứu lĩnh vực nghiên cứu Việt Nam, và Dự án Số hóa Việt Nam là một trong những nỗ lực hợp tác trong tương lai.",
    "our-collections": "Bộ sưu tập của chúng tôi",
    "studying-vietnam": "Nghiên cứu Việt Nam qua lăng kính số",
    "our-collections-content": "Bạn có muốn đọc văn bản Hán-Nôm hay xem chữ quốc ngữ được sử dụng vào đầu thế kỷ 20? Bộ sưu tập đa dạng của chúng tôi bao gồm các văn bản Hán-Nôm cổ đại đến tạp chí phụ nữ Việt Nam đầu tiên. Mặc dù không toàn diện, chúng cung cấp những bức tranh hiếm thấy về lịch sử Việt Nam.",
    "our-blog": "Blog của chúng tôi",
    "our-blog-content": "Blog là một phần đặc biệt trong trung tâm số hóa này, với nghiên cứu học thuật và những cái nhìn không chuyên sâu liên quan đến sự tiến hóa văn hóa lịch sử của Việt Nam. Chúng tôi cũng mời bạn đóng góp ý kiến ​​về các bộ sưu tập của chúng tôi và chia sẻ bất kỳ hiểu biết nào bạn có."
  },

  "AboutUs": {
    "title": "Về chúng tôi"
  },

  "Collection": {
    "title": "Bộ sưu tập của chúng tôi",
    "subtitle": "Khám phá kho lưu trữ số - nơi dành riêng cho việc bảo tồn và nghiên cứu học thuật về di sản lịch sử, văn hóa & tư tưởng Việt Nam.",
    "our-volumes": "Các Tập",
    "featured-articles": "Bài báo nổi bật",
    "no-volume-found": "Không tìm thấy tập nào.",
    "result": "kết quả"
  },

  "CollectionItem": { "page": "Trang", "missing-page": "Trang bị thiếu" },

  "CollectionMetadata": {
    "title": "Tiêu đề",
    "authors": "Tác giả",
    "resource-types": "Loại tài nguyên",
    "languages": "Ngôn ngữ",
    "subjects": "Chủ đề",
    "format": "Định dạng",
    "place-of-publication": "Nơi xuất bản",
    "date-created": "Ngày tạo",
    "publisher": "Nhà xuất bản",
    "edition": "Phiên bản",
    "identifier": "Mã định danh",
    "url": "Liên kết",
    "note": "Ghi chú",
    "access-condition": "Điều kiện truy cập",
    "related-works": "Tác phẩm liên quan"
  },

  "Outreach": {
    "title": "Thư viện giáo dục",
    "subtitle": "Khám phá và giảng dạy ngành Việt Nam học một cách hiệu quả. Sử dụng tuyển tập giáo trình, kế hoạch bài giảng và tài nguyên đa phương tiện được thiết kế nhằm hỗ trợ các trải nghiệm học tập mang tính sáng tạo và toàn diện.",
    "contributed-by": "Đóng góp bởi",

    "metadata": {
      "metadata": "Thông tin chi tiết",
      "title": "Tiêu đề",
      "lecture-title": "Tiêu đề bài giảng",
      "lecturers": "Giảng viên",
      "description": "Mô tả",
      "duration": "Thời lượng",
      "date-created": "Ngày tạo",

      "podcast-title": "Podcast",
      "episode-title": "Tập",
      "episode-number": "Tập số",
      "host": "Người dẫn",
      "guest": "Khách mời",
      "release-date": "Ngày phát hành",
      "episode-url": "Liên kết tập",
      "podcast-url": "Liên kết podcast",
      "transcript": "Bản ghi âm",

      "course-title": "Khóa học",
      "semester": "Học kỳ",
      "instructor": "Giảng viên",
      "affiliation": "Đơn vị",

      "name": "Tên",
      "creators": "Tác giả",
      "supported-languages": "Ngôn ngữ hỗ trợ",
      "access-url": "Liên kết truy cập"
    }
  },

  "Highlight": {
    "title": "Bài viết",
    "subtitle": "Những tin tức và khám phá mới nhất về hành trình số hóa, bảo tồn và nghiên cứu di sản Việt Nam.",
    "news": "Tin tức",
    "highlights": "Tin nổi bật",
    "initiatives": "Các sáng kiến"
  },

  "OnlineResource": {
    "title": "Tài nguyên tham khảo",
    "subtitle": "Tuyển tập tài nguyên được tuyển chọn dưới đây là khởi điểm tinh chọn cho các nghiên cứu về Việt Nam, với nguồn tư liệu đa dạng, đáp ứng những mối quan tâm học thuật khác nhau.",
    "no-resource-message": "Hiện không có tài nguyên nào cho danh mục này."
  },

  "Tools": {
    "subtitle": "Tiếp cận lĩnh vực Nghiên cứu Việt Nam một cách sáng tạo. Hãy sử dụng các công cụ chuyên biệt của Digitizing Việt Nam để khám phá lĩnh vực này với góc nhìn mới mẻ và tư duy phản biện.",
    "image-ocr-platform": {
      "name": "Image OCR Platform",
      "description": "Image OCR Platform là một công cụ cho phép người dùng trích xuất văn bản từ hình ảnh. Công cụ này đặc biệt hữu ích cho các nhà nghiên cứu cần trích xuất văn bản từ các tài liệu lịch sử hoặc các loại hình ảnh khác."
    },
    "han-nom-dictionaries": {
      "name": "Từ điển Hán-Nôm",
      "description": "Công cụ Từ điển Hán-Nôm là bộ sưu tập các từ điển cung cấp định nghĩa và giải thích cho các ký tự Hán-Nôm. Công cụ này đặc biệt hữu ích cho các nhà nghiên cứu cần tra cứu ý nghĩa của các ký tự Hán-Nôm trong các văn bản lịch sử.",
      "writing-pad": {
        "tooltip": "Vẽ kí tự Hán Nôm",
        "title": "Vẽ kí tự Hán Nôm",
        "description": "Dùng tay hoặc chuột để vẽ một chữ Hán Nôm vào ô bên dưới. Khi vẽ xong, nhấn Nhận dạng để xem các kết quả gợi ý. Chọn đúng chữ để nhập vào ô tìm kiếm. Nhấn Xoá để làm mới bảng vẽ.",
        "note": "Hiện nay chức năng này chỉ hỗ trợ viết chữ Hán và chữ Nôm giả tá.",
        "clear": "Xoá",
        "recognize": "Nhận diện",
        "recognizing": "Đang nhận diện..."
      },
      "no-result": "Không tìm thấy kết quả nào.",
      "dictionaries": {
        "general": {
          "name": "Tự Điển Hán Nôm",
          "description": "Đây là bộ sưu tập những từ điển và tự điển quan trọng về chữ Nôm của người Việt đã được số hoá. Bộ sưu tập bao gồm: Tự điển Chữ Nôm Dẫn giải (Nguyễn Quang Hồng), Giúp đọc Nôm và Hán Việt (Anthony Trần Văn Kiệm), Nguyễn Trãi Quốc âm Từ điển (Trần Trọng Dương), Từ điển Taberd (A.J.L. Taberd), và Nhật dụng Thường đàm (Phạm Đình Hổ).",
          "search-placeholder": "Tra cứu Hán Nôm hoặc Quốc Ngữ",
          "author": ""
        },
        "tu-dien-chu-nom-dan-giai": {
          "name": "Tự Điển Chữ Nôm Dẫn Giải",
          "description": "Cho đến nay, Tự điển chữ Nôm dẫn giải của tác giả GS.TSKH Nguyễn Quang Hồng là cuốn tự điển lớn nhất về chữ Nôm với gần 1 vạn mục từ được tác giả trích dẫn từ 124 tác phẩm cổ, văn bản cổ khác nhau thuộc nhiều thời kỳ, nhiều lĩnh vực, nhiều loại hình. Tự điển được cấu trúc có tính hệ thống, khoa học theo hai cột: một cột xác định hình chữ, âm đọc và kí mã của chữ, cột thứ hai có phần phân tích cấu trúc chữ Nôm, giải nghĩa chữ kèm theo văn cảnh cụ thể. Chú trọng tới các biến thể chữ Nôm, một mục từ có thể có một hoặc nhiều chữ Nôm với các cách viết khác nhau được ghi rõ từ các nguồn văn bản cụ thể. Đây là một điểm nhấn quan trọng của cuốn tự điển này.",
          "search-placeholder": "Tra cứu Hán Nôm hoặc Quốc Ngữ",
          "author": "GS.TSKH Nguyễn Quang Hồng"
        },
        "giup-doc-nom-va-han-viet": {
          "name": "Giúp Đọc Nôm và Hán Việt",
          "description": "Cuốn tự điển Giới thiệu đọc Nôm và Hán Việt của Linh mục Anthony Trần Văn Kiệm được cấu tạo bởi hai phần chính: Phần I là phần giới thiệu và liệt kê các bộ thủ dùng viết chữ Hán Nôm, và liệt kê các chữ Hán Nôm được sắp xếp theo bộ thủ và các nét. Phương pháp sắp xếp chữ Hán Nôm theo bộ thủ giúp cho người đọc nhanh chóng tìm được cách phát âm theo âm Hán và âm tiếng Việt của một chữ Hán Nôm, qua đó giúp người đọc nhanh chóng tìm được nghĩa của chữ Hán Nôm tương ứng trong Phần II. Phần II là phần liệt kê cách đọc của từng chữ Hán Nôm và giải thích nghĩa của từng chữ. Phần liệt kê cách đọc của một chữ Hán Nôm bao gồm âm Bắc Kinh (theo phiên âm Pinjin, tác giả gọi là Phanh Âm), âm Hán Việt và âm tiếng Việt (Nôm). Đây là một trong những cuốn sách quý hiếm dùng để tra cứu và tự học chữ Hán Nôm mà các bạn ham muốn học chữ Hán Nôm nên đọc.",
          "search-placeholder": "Tra cứu Hán Nôm hoặc Quốc Ngữ",
          "author": "Linh mục Anthony Trần Văn Kiệm"
        },
        "nguyen-trai-quoc-am-tu-dien": {
          "name": "Nguyễn Trãi Quốc Âm Từ Điển",
          "description": "Nguyễn Trãi Quốc âm Từ điển là công trình của Tiến sĩ Trần Trọng Dương, chuyên khảo ngôn ngữ trong Quốc âm thi tập — tập thơ chữ Nôm duy nhất còn lại của Nguyễn Trãi, sáng tác thế kỷ 15. Từ điển không chỉ nghiên cứu từ vựng cổ mà còn ghi lại nhiều nét văn hóa, phong tục thời trung đại. Tác phẩm tập trung giải nghĩa, truy nguyên hơn 2.500 mục từ, thành ngữ, điển cố qua 12.000 lượt âm tiết trong thơ Nguyễn Trãi, giúp người đọc hiểu sâu hơn về ngôn ngữ và văn hóa thời đại ông. Với giá trị khoa học và thực tiễn, cuốn từ điển là tài liệu quý cho nghiên cứu, giảng dạy và học tập văn học cổ Việt Nam.",
          "search-placeholder": "Tra cứu Hán Nôm hoặc Quốc Ngữ",
          "author": "Trần Trọng Dương"
        },
        "nhat-dung-thuong-dam": {
          "name": "Từ Điển Nhật Dụng Thường Đàm",
          "description": "Nhật Dụng Thường Đàm là một từ điển song ngữ Hán–Việt nhỏ, do Phạm Đình Hổ (1768–1839) biên soạn, gồm 32 chủ đề như Thiên văn, Luân lý, Nho giáo, Ẩm thực, và Loài vật, trong đó chữ Hán được giải nghĩa bằng chữ Nôm. Mặc dù có quy mô hạn chế, cuốn từ điển này giới thiệu hiệu quả các từ ngữ và cụm từ thông dụng, đồng thời là nguồn tư liệu quý giá để so sánh giữa chữ Hán và chữ Nôm. Từ điển được khắc in vào năm Tự Đức thứ tư bởi nhà in Đồng Văn Trai, hiện đang được lưu giữ tại Thư viện Quốc gia Việt Nam với ký hiệu R.1726, gồm 52 tờ được in trên giấy dó. Mỗi mục từ gồm một chữ Hán và phần giải nghĩa tương ứng bằng chữ Nôm, thể hiện rõ cấu trúc và chức năng của một từ điển song ngữ.",
          "search-placeholder": "Tra cứu Hán Nôm, Quốc Ngữ hoặc Hán Việt",
          "author": "Lê Văn Cường (phiên âm, khảo dị), Giáp Thị Hải Chi (tiếng Anh)"
        },
        "taberd": {
          "name": "Từ Điển Taberd",
          "description": "Từ điển Dictionarium Anamitico Latinum, lần đầu xuất bản năm 1884 và được tái bản năm 2004, do Giám mục người Pháp A.J.L. Taberd biên soạn, ghi chép cả chữ Nôm và chữ Quốc Ngữ thời kì đầu. Từ điển này lưu giữ nhiều từ cổ của tiếng Việt, trở thành nguồn tư liệu quan trọng để nghiên cứu và bảo tồn lịch sử chữ viết Việt Nam. Phiên bản trực tuyến, được số hóa từ ấn bản năm 2004, cho phép tra cứu theo bộ thủ theo nét hoặc theo chữ Quốc Ngữ, đồng thời bao gồm các tham chiếu về thực vật, thảo dược và chi tiết lịch sử khác. Dù có thể còn sai sót, đây vẫn là công cụ hữu ích cho các học giả và người yêu thích ngôn ngữ, và rất cần sự góp ý từ độc giả để hoàn thiện hơn.",
          "search-placeholder": "Tra cứu Hán Nôm hoặc Quốc Ngữ",
          "author": "Aditum A J. L. Taberd"
        },
        "tu-dien-chu-nom-tay": {
          "name": "Từ điển chữ Nôm Tày",
          "description": "Người Tày có chữ Nôm riêng, hình thành từ sự cải biến chữ Hán để ghi lại tiếng Tày và được dùng sáng tác văn học từ nhiều thế kỷ trước. Chữ Nôm Tày từng đóng vai trò quan trọng trong đời sống văn hóa và ngôn ngữ, hiện vẫn còn lưu giữ nhiều văn bản có giá trị ở các tỉnh miền núi phía Bắc. Vào đầu những năm 2000, một nhóm tác giả ở Cao Bằng đã biên soạn Từ điển chữ Nôm Tày, được Viện Nghiên cứu Hán Nôm thẩm định và hỗ trợ xuất bản, nhằm cung cấp công cụ nghiên cứu hữu ích cho giới học thuật. Cuốn sách phản ánh tâm huyết của nhóm tác giả trong việc gìn giữ và phát huy di sản văn hóa của dân tộc Tày. Bản số hoá của cuốn tự điển này được thực hiện với nỗ lực số hoá di sản chữ Nôm của Hội Bảo tồn chữ Nôm Việt Nam (Hoa Kỳ).",
          "search-placeholder": "Tra cứu Hán Nôm hoặc Quốc Ngữ",
          "author": "Hoàng Triều Ân (chủ biên), Dương Nhật Thanh, Hoàng Tuấn Nam"
        }
      }
    },
    "kieu-tools": {
      "name": "Công cụ Kiều",
      "description": "Công cụ Kiều là bộ sưu tập các công cụ cho phép người dùng phân tích và khám phá văn bản Truyện Kiều của Nguyễn Du. Công cụ này đặc biệt hữu ích cho các nhà nghiên cứu cần phân tích chi tiết văn bản Truyện Kiều.",
      "tools": {
        "glossary": {
          "name": "Bảng chú các chữ Nôm trong mỗi bản Kiều",
          "description": "Danh sách tất cả các chữ Nôm và số lần xuất hiện trong một bản Kiều.",
          "version-not-found": "Không tìm thấy phiên bản Kiều tương ứng",
          "version": "Phiên bản",
          "nom": "Nôm",
          "quoc-ngu": "Quốc Ngữ",
          "frequency": "Tần suất",
          "entries": "mục từ"
        },
        "glossary-all": {
          "name": "Bảng chú các chữ Nôm trong tất cả bản Kiều",
          "description": "Danh sách tất cả các chữ Nôm và số lần xuất hiện trong tất cả bản Kiều."
        }
      }
    },
    "han-nom-tools": {
      "name": "Công cụ Hán-Nôm",
      "description": "Công cụ Hán-Nôm là tập hợp các tiện ích số hỗ trợ phân tích và khám phá văn bản chữ Hán và chữ Nôm trong di sản văn hóa Việt Nam. Với các tính năng xử lý, tra cứu và phân tích cấu trúc văn bản, công cụ này đặc biệt hữu ích cho các nhà nghiên cứu ngôn ngữ, văn học cổ và lịch sử văn hóa, góp phần bảo tồn và phát huy giá trị di sản Hán-Nôm trong kỷ nguyên số.",
      "tools": {
        "han-nom-input-method-editor": {
          "name": "Bộ gõ Hán-Nôm",
          "description": "Khác với các bộ gõ Hán-Nôm truyền thống, bộ gõ này cho phép người dùng nhập trực tiếp chữ Hán và chữ Nôm ngay trên trình duyệt web, mà không cần cài đặt bất kỳ phần mềm nào. Nhờ tính linh hoạt cao, công cụ có thể được sử dụng trên mọi thiết bị có kết nối internet, mang lại sự thuận tiện tối đa cho người dùng trong quá trình tra cứu và soạn thảo văn bản Hán-Nôm. Đây là một giải pháp hữu ích cho cả người học lẫn các nhà nghiên cứu cần thao tác nhanh chóng và hiệu quả với văn bản cổ.",
          "type-in-quoc-ngu": "Nhập chữ Quốc Ngữ...",
          "input-method": "Phương thức nhập",
          "quoc-ngu": "Quốc Ngữ",
          "handwriting": "Viết tay",
          "radical": "Bộ thủ",
          "output-placeholder": "Văn bản Hán-Nôm sẽ hiển thị ở đây..."
        },
        "han-nom-from-quoc-ngu": {
          "name": "Hán-Nôm từ Quốc Ngữ",
          "description": "Chuyển đổi văn bản Quốc Ngữ thành chữ Hán-Nôm bằng phương pháp nhập liệu thông minh theo câu. Gõ toàn bộ câu bằng chữ Quốc Ngữ và nhận gợi ý ký tự ngay lập tức với hỗ trợ từ ghép.",
          "type-in-quoc-ngu": "Nhập chữ Quốc Ngữ..."
        },
        "nom-character-classification-and-analysis-tool": {
          "name": "Công cụ Thống kê và Phân loại Chữ Nôm",
          "description": "Đây là một công cụ hiện đại và hiệu quả, hỗ trợ các nhà nghiên cứu văn bản Hán Nôm trong việc thống kê và phân loại chữ Nôm dựa trên hệ thống tiêu chí được trình bày trong Tự điển Chữ Nôm Dẫn giải của học giả Nguyễn Quang Hồng. Người dùng chỉ cần tải văn bản Hán Nôm lên hệ thống; công cụ sẽ tự động xử lý, cung cấp bảng thống kê chi tiết cùng các phân loại chữ Nôm xuất hiện trong văn bản. Đây là một trợ thủ đắc lực trong các nghiên cứu ngôn ngữ, văn tự và văn bản học liên quan đến di sản Hán Nôm.",
          "type-in-han-nom": "Nhập văn bản Hán Nôm..."
        },
        "radicals": {
          "name": "Tra cứu bộ thủ Nôm",
          "select-radical": "Chọn một bộ thủ:",
          "stroke": "nét",
          "strokes": "nét",
          "stroke-label": "Nét:",
          "name-label": "Tên:",
          "definition-label": "Nghĩa:",
          "radical-strokes": "Số nét bộ thủ:",
          "loading-characters": "Đang tải chữ...",
          "no-characters-found": "Không tìm thấy chữ nào cho bộ thủ này.",
          "select-strokes": "Chọn số nét:",
          "select-stroke-to-view": "Chọn số nét để xem các chữ",
          "copied-to-clipboard": "Đã sao chép vào bộ nhớ tạm",
          "failed-to-copy": "Sao chép không thành công",
          "failed-to-load-characters": "Không thể tải chữ",
          "no-definition": "Không có định nghĩa"
        },
        "quoc-ngu-input": {
          "placeholder": "Nhập từ Quốc Ngữ...",
          "select-character": "Chọn chữ (nhấn 1-9 hoặc bấm):"
        }
      }
    }
  },

  "SearchResult": {
    "title": "Kết quả tìm kiếm",
    "showing": "Hiển thị",
    "search-result-for": "kết quả tìm kiếm cho",
    "no-search-result": "Không tìm thấy kết quả nào.",
    "search-across-website": "Tìm kiếm trên trang web Digitizing Việt Nam"
  },

  "Filter": {
    "result": "kết quả",
    "apply-filters": "Áp dụng bộ lọc",
    "category": {
      "part_of": "Thuộc về",
      "collections": "Bộ sưu tập",
      "authors": "Tác giả",
      "languages": "Ngôn ngữ",
      "subjects": "Chủ đề",
      "formats": "Định dạng",
      "resource_types": "Loại tài nguyên",
      "collection_locations": "Địa điểm bộ sưu tập",
      "access_condition": "Điều kiện truy cập",
      "online_resource_types": "Loại tài nguyên trực tuyến"
    }
  }
}
