{
  "btn-learn-more": "Tìm hiểu thêm",
  "btn-read-more": "Đọc thêm",
  "btn-load-more": "Tải thêm",
  "btn-search": "Tìm kiếm",

  "home": "Trang chủ",
  "about-us": "Về chúng tôi",
  "our-collections": "Bộ sưu tập",
  "tools": "Công cụ",
  "blogs": "Bài viết",
  "online-resources": "Tài nguyên",

  "home-welcome-subtitle": "Trung tâm số hóa nghiên cứu về Việt Nam cận đại và hiện đại",
  "home-about-digitizing-vietnam": "Về Dự án Số hóa Việt Nam",
  "home-about-digitizing-vietnam-content": "Dự án Số hóa Việt Nam là bước nhảy vọt số hóa trong nghiên cứu Việt Nam do Columbia và Fulbright hợp tác. Dự án bắt đầu từ hiệp định ghi nhớ giữa hai trường đại học vào năm 2022. Viện Đông Á học của Đại học Columbia và Trung tâm Nghiên cứu Việt Nam của Fulbright sẽ dẫn đầu trong nghiên cứu lĩnh vực nghiên cứu Việt Nam, và Dự án Số hóa Việt Nam là một trong những nỗ lực hợp tác trong tương lai.",
  "home-our-collections": "Bộ sưu tập của chúng tôi",
  "home-our-collections-content": "Bạn có muốn đọc văn bản Hán-Nôm hay xem chữ quốc ngữ được sử dụng vào đầu thế kỷ 20? Bộ sưu tập đa dạng của chúng tôi bao gồm các văn bản Hán-Nôm cổ đại đến tạp chí phụ nữ Việt Nam đầu tiên. Mặc dù không toàn diện, chúng cung cấp những bức tranh hiếm thấy về lịch sử Việt Nam.",
  "home-our-blog": "Blog của chúng tôi",
  "home-our-blog-content": "Blog là một phần đặc biệt trong trung tâm số hóa này, với nghiên cứu học thuật và những cái nhìn không chuyên sâu liên quan đến sự tiến hóa văn hóa lịch sử của Việt Nam. Chúng tôi cũng mời bạn đóng góp ý kiến ​​về các bộ sưu tập của chúng tôi và chia sẻ bất kỳ hiểu biết nào bạn có.",

  "about-us-title": "Về chúng tôi",

  "collections-title": "Bộ sưu tập của chúng tôi",
  "collections-subtitle": "Khám phá kho lưu trữ số hóa dành riêng cho nghiên cứu và bảo tồn di sản lịch sử và tri thức của Việt Nam.",

  "each-collection-our-volumes": "Các Tập",
  "each-collection-featured-articles": "Những Bài báo nổi bật",

  "blogs-title": "Việt Nam Số hóa: Blog",
  "blogs-subtitle": "Thông tin, nhận định và các sáng kiến trên mặt trận số hóa di sản Việt Nam.",
  "blogs-news": "Tin tức",
  "blogs-highlights": "Tin nổi bật",
  "blogs-initiatives": "Các sáng kiến",

  "online-resources-title": "Tài nguyên Trực tuyến",
  "online-resources-subtitle": "Bạn đang tìm kiếm một nền tảng để nghiên cứu về Việt Nam? Hãy khám phá một số tài nguyên dưới đây và tìm sự phù hợp nhất.",
  "online-resources-no-resource-message": "Hiện không có tài nguyên nào cho danh mục này."
}
